Revit 2024 API
AssetPropertyUInt64 Class
 Represents a property of UInt64 value.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class AssetPropertyUInt64 : AssetProperty
Visual Basic
Public Class AssetPropertyUInt64 _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyUInt64 : public AssetProperty
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyUInt64
See Also
AssetPropertyUInt64 Members
Autodesk.Revit.DB.Visual Namespace